src/DataProcessors/ГрупповоеСписаниеМПЗ/ГрупповоеСписаниеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповоеСписаниеМПЗ</name>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяСписания</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/СписаниеМПЗПрочее/СписаниеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеНаЛинейку</types>
      <types>DocumentRef.Разукомплектовка</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ГрупповоеСписаниеМПЗ/Forms/Форма/Module.bsl
&НаСервере
Функция СписатьНаСервере()
Запрос = Новый Запрос;

Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
Списание.Дата = ТекущаяДата();
Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(Объект.МестоХранения.Подразделение));
Списание.Автор = ПараметрыСеанса.Пользователь;
Списание.Подразделение = Объект.МестоХранения.Подразделение;
Списание.МестоХранения = Объект.МестоХранения;
Списание.Статья = Объект.СтатьяСписания;
Списание.Утвердил = Объект.Утвердил;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.ВидМПЗ,
	|	МестаХраненияОстатки.МПЗ,
	|	МестаХраненияОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки(&НаДату, ) КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.МестоХранения = &МестоХранения
	|	И МестаХраненияОстатки.ВидМПЗ = &ВидМПЗ";
Запрос.УстановитьПараметр("МестоХранения", Объект.МестоХранения);
Запрос.УстановитьПараметр("ВидМПЗ", ?(ВидМПЗ = 1, Перечисления.ВидыМПЗ.Материалы, Перечисления.ВидыМПЗ.Полуфабрикаты));
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = Списание.ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = ВыборкаДетальныеЗаписи.ВидМПЗ;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ТЧ.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток/ВыборкаДетальныеЗаписи.МПЗ.ОсновнаяЕдиницаИзмерения.Коэффициент;
	ТЧ.ЕдиницаИзмерения =  ВыборкаДетальныеЗаписи.МПЗ.ОсновнаяЕдиницаИзмерения;	
	КонецЦикла;
		Если Списание.ТабличнаяЧасть.Количество() > 0 Тогда
		Списание.Записать(РежимЗаписиДокумента.Проведение);	
		Возврат(Списание.Ссылка);
		Иначе
		Возврат(Документы.СписаниеМПЗПрочее.ПустаяСсылка());
		КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура Списать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Док = СписатьНаСервере();	
		Если Не Док.Пустая() Тогда
		П = Новый Структура("Ключ",Док);
		ОткрытьФорму("Документ.СписаниеМПЗПрочее.Форма.ФормаДокумента",П);
		Иначе
		Сообщить("Документ списания не создан!");
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидМПЗ = 1;
КонецПроцедуры
